z2akhtar-zz/PWC-Demonstrator/AUTOSAR/core/arch/ppc/mpc55xx/drivers/Lin.c
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 * 
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with  
 * the terms contained in the written license agreement between you and ArcCore, 
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as 
 * published by the Free Software Foundation and appearing in the file 
 * LICENSE.GPL included in the packaging of this file or here 
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/

/** @tagSettings DEFAULT_ARCHITECTURE=NOT_USED */
/** @reqSettings DEFAULT_SPECIFICATION_REVISION=4.1.2 */

#include "Lin.h"
#include "LinIf_Cbk.h"
#include "mpc55xx.h"
#if defined(USE_DET)
#include "Det.h"
#endif
#include "Mcu.h"
#include <stdlib.h>
#include <string.h>
#include "LinIf_Cbk.h"
#include "Os.h"
#include "isr.h"
#include "irq.h"
#include "arc.h"

/** General requirements tagging */
/* @req SWS_Lin_00103 */
/* @req SWS_Lin_00011 */
/* @req SWS_Lin_00013 */
/* @req SWS_Lin_00014 */
/* @req SWS_Lin_00015 */
/* @req SWS_Lin_00156 */
/* @req SWS_Lin_00017 */
/* @req SWS_Lin_00018 */
/* @req SWS_Lin_00019 */
/* @req SWS_Lin_00184 */
/* @req SWS_Lin_00207 */
/* @req SWS_Lin_00224 */
/* @req SWS_Lin_00225 */
/* @req SWS_Lin_00235 */
/* @req SWS_Lin_00237 */
/* @req SWS_Lin_00239 */
/* @req SWS_Lin_00240 */
/* @req SWS_Lin_00027 */
/* @req SWS_Lin_00028 */
/* @req SWS_Lin_00029 */
/* @req SWS_Lin_00045 */
/* @req SWS_Lin_00005 */
/* @req SWS_Lin_00055 */


/* ERRATA for REV_A of 551x chip. Will use a GPT timer for timeout handling */

#ifdef MPC551X_ERRATA_REV_A
#include "Gpt.h"

static Gpt_ChannelType LinChannelTimeOutGptChannelId[ LIN_CONTROLLER_CNT ];
static uint32          LinChannelBitTimeInTicks[ LIN_CONTROLLER_CNT ];
#endif

#define LIN_MAX_MSG_LENGTH 8

#if defined(CFG_MPC5567) || defined(CFG_MPC563XM) || defined(CFG_MPC5644A)
#define ESCI(exp) (volatile struct ESCI_tag *)(0xFFFB0000 + (0x4000 * exp))
#else
#define ESCI(exp) (volatile struct ESCI_tag *)(0xFFFA0000 + (0x4000 * exp))
#endif

/* Reset -> LIN_UNINIT: After reset, the Lin module shall set its state to LIN_UNINIT. */
/* @req SWS_Lin_00145 */
static Lin_DriverStatusType LinDriverStatus = LIN_UNINIT;

static Lin_StatusType LinChannelStatus[LIN_CONTROLLER_CNT];
static Lin_StatusType LinChannelOrderedStatus[LIN_CONTROLLER_CNT];

static const Lin_ConfigType* LinConfigPtr = 0;

/* static buffers, holds one frame at a time */
static uint8 LinBufTx[LIN_CONTROLLER_CNT][LIN_MAX_MSG_LENGTH];
static uint8 LinBufRx[LIN_CONTROLLER_CNT][LIN_MAX_MSG_LENGTH];

static uint8 *TxCurrPtr[LIN_CONTROLLER_CNT];
static uint8  TxSize[LIN_CONTROLLER_CNT];
static uint8 *RxCurrPtr[LIN_CONTROLLER_CNT];
static uint8  RxSize[LIN_CONTROLLER_CNT];

#if (LIN_VERSION_INFO_API == STD_ON)
static Std_VersionInfoType _Lin_VersionInfo =
{ .vendorID = (uint16)60, .moduleID = (uint16) LIN_MODULE_ID,
        .sw_major_version = (uint8)LIN_SW_MAJOR_VERSION,
        .sw_minor_version = (uint8)LIN_SW_MINOR_VERSION,
        .sw_patch_version = (uint8)LIN_SW_PATCH_VERSION
};
#endif

/* Development error macros. */
#if ( LIN_DEV_ERROR_DETECT == STD_ON )
#define VALIDATE(_exp,_api,_err ) \
        if( !(_exp) ) { \
          Det_ReportError(LIN_MODULE_ID,0,_api,_err); \
          return; \
        }

#define VALIDATE_W_RV(_exp,_api,_err,_rv ) \
        if( !(_exp) ) { \
          Det_ReportError(LIN_MODULE_ID,0,_api,_err); \
          return (_rv); \
        }
#else
#define VALIDATE(_exp,_api,_err )
#define VALIDATE_W_RV(_exp,_api,_err,_rv )
#endif

typedef volatile union
{
  uint32_t R;
  struct {
	  uint32_t PID:8;
	  uint32_t :24;
  } B1;
  struct {
	  uint32_t L:8;
	  uint32_t :24;
  } B2;
  struct {
	  uint32_t HDCHK:1;
	  uint32_t CSUM:1;
	  uint32_t XCRC:1; /* Renamed CRC to XCRC to avoid conflict with macro CRC in MPC5644A.h. */
	  uint32_t TX:1;
	  uint32_t TN:4;
	  uint32_t :24;
  } B3;
  struct {
	  uint32_t T:8;
	  uint32_t :24;
  } B4;
  struct {
	  uint32_t D:8;
	  uint32_t :24;
  } B5;
}LinLTRType;

typedef volatile union {
    vuint32_t R;
    struct {
        vuint32_t TDRE:1;
        vuint32_t TC:1;
        vuint32_t RDRF:1;
        vuint32_t IDLE:1;
        vuint32_t OR:1;
        vuint32_t NF:1;
        vuint32_t FE:1;
        vuint32_t PF:1;
          vuint32_t:3;
        vuint32_t BERR:1;
          vuint32_t:3;
        vuint32_t RAF:1;
        vuint32_t RXRDY:1;
        vuint32_t TXRDY:1;
        vuint32_t LWAKE:1;
        vuint32_t STO:1;
        vuint32_t PBERR:1;
        vuint32_t CERR:1;
        vuint32_t CKERR:1;
        vuint32_t FRC:1;
          vuint32_t:7;
        vuint32_t OVFL:1;
    } B;
} LinSRtype;   /* Status Register */

static void ResyncDriver(uint8 Channel)
{
	volatile struct ESCI_tag * esciHw = ESCI(LinConfigPtr->LinChannelConfig[Channel].LinChannelId);

	esciHw->LCR.B.TXIE = 0; /* Disable tx irq */
	esciHw->LCR.B.RXIE = 0; /* Disable Rx Interrupt */
	esciHw->LCR.B.FCIE = 0; /* Disable Rx Interrupt */

	/* Disable transmitter and receiver. */
	esciHw->CR1.B.TE = 0;
	esciHw->CR1.B.RE = 0;

  	/* Clear flags  */
	esciHw->SR.R = esciHw->SR.R;

	/* Prepare module for resynchronization. */
	esciHw->LCR.B.LRES = 1; /* LIN Resynchronize. First set then cleared. */
	/* Resynchronize module. */
	esciHw->LCR.B.LRES = 0; /* LIN Resynchronize. First set then cleared. */

	/* Enable transmitter and receiver. */
	esciHw->CR1.B.TE = 1;
	esciHw->CR1.B.RE = 1;

#if 0 /* This needs if we Disable Fast Bit Error Detection otherwise SR will not be cleared properly....strange */
	volatile uint32 i;
	for(i=0; i < 10000; ){
	  i++;
	}
#endif

	/* Clear set flags again */
	esciHw->SR.R = esciHw->SR.R;
}


void LinInterrupt(uint8 hwId)
{
	volatile struct ESCI_tag * esciHw = ESCI(hwId);
	uint8 Channel = LinConfigPtr->Lin_HwId2ChannelMap[hwId];
	LinSRtype sr, tmp;
	LinLTRType tmpLtr;
#ifdef MPC551X_ERRATA_REV_A
	uint8 stopTimeOutTimer = FALSE;
#endif 

