z2akhtar-zz/PWC-Demonstrator/AUTOSAR/core/arch/ppc/mpc55xx/drivers/Lin.c
	sr.R = esciHw->SR.R;

	/* Clear flags */
	tmp.R = 0;
	if(sr.B.TXRDY == 1){tmp.B.TXRDY = 1;}
	if(sr.B.RXRDY == 1){tmp.B.RXRDY = 1;}
	if(sr.B.TC == 1){tmp.B.TC = 1;}
	if(sr.B.RDRF == 1){tmp.B.RDRF = 1;}
	if(sr.B.IDLE == 1){tmp.B.IDLE = 1;}
	if(sr.B.OVFL == 1){tmp.B.OVFL = 1;}
	if(sr.B.FRC == 1){tmp.B.FRC = 1;}

	esciHw->SR.R = tmp.R;
	esciHw->LCR.B.TXIE = 0; /* Always disable Tx Interrupt */

	/* TX */
	if (LinChannelStatus[Channel]==LIN_TX_BUSY) {
		/* Maybe transmit next byte */
		if (TxSize[Channel] > 0 && sr.B.TXRDY) {
			tmpLtr.R = 0; /* Clear */
			tmpLtr.B4.T = *TxCurrPtr[Channel];
			TxCurrPtr[Channel]++; TxSize[Channel]--;
			esciHw->LCR.B.TXIE = 1; /* Enable tx irq */
			esciHw->LTR.R=tmpLtr.R; /* write to transmit reg */
 		}
		else {
			if(sr.B.FRC == 1){
				/* Transmission complete */
				LinChannelStatus[Channel] = LIN_TX_OK;
			    /* @req SWS_Lin_00157 */
				esciHw->LCR.B.TXIE = 0; /* Disable tx irq */
			}
			else{
				LinChannelStatus[Channel] = LIN_TX_ERROR;
			}
#ifdef MPC551X_ERRATA_REV_A
			/* Transmission is over. */
			stopTimeOutTimer = TRUE;
#endif 
		}
	}	/* RX */
	/* @req SWS_Lin_00060 */
	else if (LinChannelStatus[Channel]==LIN_RX_BUSY) {
	  /* Maybe receive next byte */
		if (RxSize[Channel] > 0 && sr.B.RXRDY) {
			tmpLtr.R = esciHw->LRR.R;
			/* @req SWS_Lin_00096 */
			*RxCurrPtr[Channel] = tmpLtr.B5.D;
			RxCurrPtr[Channel]++; RxSize[Channel]--;
 		} else if (RxSize[Channel] == 0 && sr.B.FRC == 1){
			/* receive complete */
			LinChannelStatus[Channel] = LIN_RX_OK;
            /* @req SWS_Lin_00157 */
			esciHw->LCR.B.RXIE = 0; /* Disable Rx Interrupt */
			esciHw->LCR.B.FCIE = 0; /* Disable Rx Interrupt */
#ifdef MPC551X_ERRATA_REV_A
			/* Transmission is over. */
			stopTimeOutTimer = TRUE;
#endif 
 		}
	}

	/* Error handling
	 * OR    - Overrun
	 * NF    - Noise fault
	 * FE    - Framing Error
	 * PF    - Parity fault
	 * BERR  - Bit error (read back)
	 * STO   - Slave Timeout
	 * PBERR - Physical bit error
	 * CERR  - CRC error
	 * CKERR - Checksum error
	 * OVFL  - Overflow flag
	 */
	if(sr.B.OR || sr.B.NF || sr.B.FE || sr.B.PF || sr.B.BERR || sr.B.STO || sr.B.PBERR ||
	   sr.B.CERR || sr.B.CKERR || sr.B.OVFL) {
		static uint32 errCnt=0;
		errCnt++;
		// LIN_RX_NO_RESPONSE - Slave Timeout LIN_TX_HEADER_ERROR - Parity Fault or Bit error or Physical bus error
		if(LinChannelStatus[Channel]==LIN_RX_BUSY){
			/** Slave timeout */
			if (sr.B.STO) {
				LinChannelStatus[Channel] = LIN_RX_NO_RESPONSE;
			}
			/** Parity error in the header, bit error and physical bus error (This can be detected only for headers for Rx Frame)*/
			else if (sr.B.PF || sr.B.BERR ||sr.B.PBERR) {
				LinChannelStatus[Channel] = LIN_TX_HEADER_ERROR;
			}
			else {
				LinChannelStatus[Channel] = LIN_RX_ERROR;
			}

		}
		//LIN_TX_HEADER_ERROR - Parity Fault or Bit error or Physical bus error when header has been transmitted
		else if (LinChannelStatus[Channel]==LIN_TX_ERROR){
			//check condition error occurred for header and not data. tmpLtr.B2.L = DL & TxSize[Channel] set to DL when header tx
			if ((sr.B.PF || sr.B.BERR ||sr.B.PBERR) && (tmpLtr.B2.L == TxSize[Channel])) {
				LinChannelStatus[Channel] = LIN_TX_HEADER_ERROR;
			}
			else {
				LinChannelStatus[Channel] = LIN_TX_ERROR;
			}
		}

	  	/* Clear flags  */
        /* @req SWS_Lin_00157 */
		esciHw->SR.R=0xffffffff;

		/* Resynchronize driver in GetStatus call */

#ifndef MPC551X_ERRATA_REV_A
	}
#else
		/* Transmission is over. */
		stopTimeOutTimer = TRUE;
	}

	/* Handle LIN Wake Up reset manually. See [Freescale Device Errata MPC5510ACE, Rev. 10 APR 2009, errata ID: 8632]. */
	if( sr.B.LWAKE )
	{
		/* Resynchronize driver. */
		esciHw->LCR.B.LRES = 1; /* LIN Resynchronize. First set then cleared */
		esciHw->LCR.B.LRES = 0; /* LIN Resynchronize. First set then cleared */

		/* Transmission is over. */
		stopTimeOutTimer = TRUE;
	}

	if( TRUE == stopTimeOutTimer )
	{
		Gpt_StopTimer( LinChannelTimeOutGptChannelId[ Channel ] );
	}
#endif

	if (LinChannelOrderedStatus[Channel]==LIN_CH_SLEEP_PENDING){
		/** @req SWS_Lin_00266*/
		LinChannelStatus[Channel] = LIN_CH_SLEEP_PENDING;
		LinChannelOrderedStatus[Channel]=LIN_OPERATIONAL;
	}
}

#ifdef LIN_CHANNEL_0_USED
ISR(LinInterruptA){ LinInterrupt(0);}
#endif
#ifdef LIN_CHANNEL_1_USED
ISR(LinInterruptB){ LinInterrupt(1);}
#endif

#if !defined(CFG_MPC5567) && !defined(CFG_MPC563XM)
#ifdef LIN_CHANNEL_2_USED
ISR(LinInterruptC){ LinInterrupt(2);}
#endif
#if !defined(CFG_MPC5644A)
#ifdef LIN_CHANNEL_3_USED
ISR(LinInterruptD){ LinInterrupt(3);}
#endif
#ifdef LIN_CHANNEL_4_USED
ISR(LinInterruptE){ LinInterrupt(4);}
#endif
#ifdef LIN_CHANNEL_5_USED
ISR(LinInterruptF){ LinInterrupt(5);}
#endif
#ifdef LIN_CHANNEL_6_USED
ISR(LinInterruptG){ LinInterrupt(6);}
#endif
#ifdef LIN_CHANNEL_7_USED
ISR(LinInterruptH){ LinInterrupt(7);}
#endif
#endif
#endif


#ifdef MPC551X_ERRATA_REV_A
void LinTimeOutInterrupt( uint8 hwId )
{
	/* We ended up here because of that the eSCI module for the given channel has stopped internally.
	* Now we have to reset the LIN module state machine ourself.
	* See [Freescale Device Errata MPC5510ACE, Rev. 10 APR 2009, errata ID: 8173 and 4968]. */

	volatile struct ESCI_tag *esciHw = ESCI( hwId );
	uint8 Channel = LinConfigPtr->Lin_HwId2ChannelMap[hwId];

	/* Make sure that the timer it stopped (e.g. if by mistake setup as continuously). */
	Gpt_StopTimer( LinChannelTimeOutGptChannelId[ channel ] );

	/* @req SWS_Lin_00157 */
	/* Disable transmitter and receiver. */
	esciHw->CR1.B.TE = 0;
	esciHw->CR1.B.RE = 0;

	/* Prepare module for resynchronization. */
	esciHw->LCR.B.LRES = 1; /* LIN Resynchronize. First set then cleared. */

	/* Enable transmitter and receiver. */
	esciHw->CR1.B.TE = 1;
	esciHw->CR1.B.RE = 1;

	/* Resynchronize module. */
	esciHw->LCR.B.LRES = 0; /* LIN Resynchronize. First set then cleared. */
}

#ifdef LIN_CHANNEL_0_USED
ISR(LinTimeOutInterruptA){LinTimeOutInterrupt(0);}
#endif
#ifdef LIN_CHANNEL_1_USED
ISR(LinTimeOutInterruptB){LinTimeOutInterrupt(1);}
#endif

#if !defined(CFG_MPC5567) && !defined(CFG_MPC563XM)
#ifdef LIN_CHANNEL_2_USED
ISR(LinTimeOutInterruptC){LinTimeOutInterrupt(2);}
#endif
#if !defined(CFG_MPC5644A)
#ifdef LIN_CHANNEL_3_USED
ISR(LinTimeOutInterruptD){LinTimeOutInterrupt(3);}
#endif
#ifdef LIN_CHANNEL_4_USED
ISR(LinTimeOutInterruptE){LinTimeOutInterrupt(4);}
#endif
#ifdef LIN_CHANNEL_5_USED
ISR(LinTimeOutInterruptF){LinTimeOutInterrupt(5);}
#endif
#ifdef LIN_CHANNEL_6_USED
ISR(LinTimeOutInterruptG){LinTimeOutInterrupt(6);}
#endif
#ifdef LIN_CHANNEL_7_USED
ISR(LinTimeOutInterruptH){LinTimeOutInterrupt(7);}
#endif
#endif
#endif
#endif

/** @req SWS_Lin_00006 */
void Lin_Init( const Lin_ConfigType* Config )
{
	uint8 i;
	LinConfigPtr = Config;
    enum
    {
      LIN_PRIO = 3
    };
    /** @req SWS_Lin_00105 **/
    /* @req SWS_Lin_00213 */
	VALIDATE( (LinDriverStatus == LIN_UNINIT), LIN_INIT_SERVICE_ID, LIN_E_STATE_TRANSITION );
	/** @req SWS_Lin_00099 **/
	/** @req SWS_Lin_00216 **/
	VALIDATE( (Config!=NULL), LIN_INIT_SERVICE_ID, LIN_E_INVALID_POINTER );

