z2akhtar-zz/PWC-Demonstrator/AUTOSAR/core/arch/ppc/mpc55xx/drivers/Lin.c
	for (i=0;i<LIN_CONTROLLER_CNT;i++)
	{
		TxCurrPtr[i] = 0;
		TxSize[i] = 0;
		RxCurrPtr[i] = 0;
		RxSize[i] = 0;
#ifdef MPC551X_ERRATA_REV_A
		LinChannelTimeOutGptChannelId[ i ] = 0;
		LinChannelBitTimeInTicks[ i ] = 0;
#endif
	}

	/* Install the interrupt */
	/* @req SWS_Lin_00155 */
#if defined(CFG_MPC5567) || defined(CFG_MPC563XM) || defined(CFG_MPC5644A)
#ifdef LIN_CHANNEL_0_USED
    ISR_INSTALL_ISR2("LinIsr", LinInterruptA, (IrqType)(ESCI_A_COMB),LIN_PRIO, 0);
#endif
#ifdef LIN_CHANNEL_1_USED
    ISR_INSTALL_ISR2("LinIsr", LinInterruptB, (IrqType)(ESCI_B_COMB),LIN_PRIO, 0);
#endif

#if defined(CFG_MPC5644A)
#ifdef LIN_CHANNEL_2_USED
    ISR_INSTALL_ISR2("LinIsr", LinInterruptC, (IrqType)(ESCI_C_COMB),LIN_PRIO, 0);
#endif
#endif

#else
#ifdef LIN_CHANNEL_0_USED
    ISR_INSTALL_ISR2("LinIsr", LinInterruptA, (IrqType)(SCI_A_COMB),LIN_PRIO, 0);
#endif
#ifdef LIN_CHANNEL_1_USED
    ISR_INSTALL_ISR2("LinIsr", LinInterruptB, (IrqType)(SCI_B_COMB),LIN_PRIO, 0);
#endif
#ifdef LIN_CHANNEL_2_USED
    ISR_INSTALL_ISR2("LinIsr", LinInterruptC, (IrqType)(SCI_C_COMB),LIN_PRIO, 0);
#endif
#ifdef LIN_CHANNEL_3_USED
    ISR_INSTALL_ISR2("LinIsr", LinInterruptD, (IrqType)(SCI_D_COMB),LIN_PRIO, 0);
#endif
#ifdef LIN_CHANNEL_4_USED
    ISR_INSTALL_ISR2("LinIsr", LinInterruptE, (IrqType)(SCI_E_COMB),LIN_PRIO, 0);
#endif
#ifdef LIN_CHANNEL_5_USED
    ISR_INSTALL_ISR2("LinIsr", LinInterruptF, (IrqType)(SCI_F_COMB),LIN_PRIO, 0);
#endif
#ifdef LIN_CHANNEL_6_USED
    ISR_INSTALL_ISR2("LinIsr", LinInterruptG, (IrqType)(SCI_G_COMB+2),LIN_PRIO, 0);
#endif
#ifdef LIN_CHANNEL_7_USED
    ISR_INSTALL_ISR2("LinIsr", LinInterruptH, (IrqType)(SCI_H_COMB+3),LIN_PRIO, 0);
#endif
#endif
        /* Initialize the hardware specifics for each supported channel */
	    /** @req SWS_Lin_00190 */
	    /** @req SWS_Lin_00008  */
	    /** @req SWS_Lin_00084 */
	    for (uint8 Channel =0; Channel < LIN_CONTROLLER_CNT; Channel++) {
	        volatile struct ESCI_tag * esciHw = ESCI(LinConfigPtr->LinChannelConfig[Channel].LinChannelId);

	        esciHw->CR2.B.MDIS = 0;/* The module is enabled by writing the ESCIx_CR2[MDIS] bit to 0. */

	        esciHw->CR1.B.RE = 1;
	        esciHw->CR1.B.M = 0; /* The data format bit ESCIx_CR1[M], is set to 0 (8 data bits), and the parity is disabled (PE = 0).*/
	        esciHw->CR1.B.PE = 0;
	        esciHw->CR1.B.TIE = 0; /*ESCIx_CR1[TIE], ESCIx_CR1[TCIE], ESCIx_CR1[RIE] interrupt enable bits should be inactive.*/
	        esciHw->CR1.B.TCIE = 0;
	        esciHw->CR1.B.RIE = 0;
	          /* Set up ESCIx_CR1 for LIN */
	          /*
	           * SCI Baud Rate. Used by the counter to determine the baud rate of the eSCI.
	           * The formula for calculating the baud rate is:
	           *
	           *                      eSCI system clock
	           * SCI baud rate =   -----------------------
	           *                          16 * SBR
	           *
	           * where SBR can contain a value from 1 to 8191. After reset, the baud generator
	           * is disabled until the TE bit or the RE bit is set for the first time. The baud
	           * rate generator is disabled when SBR = 0x0.
	           */
	        /** @req SWS_Lin_00150 */
	        esciHw->CR1.B.SBR  = Mcu_Arc_GetPeripheralClock((Mcu_Arc_PeriperalClock_t)Config->LinChannelConfig[Channel].LinClockRef)/(16*Config->LinChannelConfig[Channel].LinChannelBaudRate);
	        esciHw->LCR.B.LIN = 1;  /* Instead, the LIN interrupts should be used.Switch eSCI to LIN mode (ESCIx_LCR[LIN] = 1).*/

	        esciHw->CR2.B.BRK13 = 1;/* The LIN standard requires that the break character always be 13 bits long
	        (ESCIx_CR2[BRK13] = 1). The eSCI will work with BRK13=0, but it will violate LIN 2.0. */

	    #ifdef MPC551X_ERRATA_REV_A
	        esciHw->LCR.B.LDBG = 1; /* Enable LIN debug => Disable automatic reset of the LIN FSM. See [Freescale Device Errata MPC5510ACE, Rev. 10 APR 2009, errata ID: 8632] */
	        esciHw->CR2.B.FBR = 1;  /* Disable Fast Bit Error Detection. See [Freescale Device Errata MPC5510ACE, Rev. 10 APR 2009, errata ID: 8635] */
	    #else
	    #if !defined(CFG_MPC563XM)
	        esciHw->LCR.B.LDBG = 0; /* Normally, bit errors should cause the LIN FSM to reset, stop driving the bus immediately, and stop
	                                 * further DMA requests until the BERR flag has been cleared. Set ESCIx_LCR[LDBG] = 0,*/
	    #endif
	        esciHw->CR2.B.FBR = 1;    /* Fast bit error detection provides superior error checking, so ESCIx_CR2[FBR] should be set; */
	    #endif
	        esciHw->LCR.B.STIE = 1; /* Enable some fault irq's */
	        esciHw->LCR.B.PBIE = 1;
	        esciHw->LCR.B.CKIE = 1;
	        esciHw->LCR.B.OFIE = 1;

	        esciHw->CR2.B.SBSTP = 1;/*ESCIx_CR2[SBSTP] = 1, and ESCIx_CR2[BSTP] = 1 to accomplish these functions.*/
	        esciHw->CR2.B.BSTP = 1;

	        esciHw->CR2.B.BESM13 = 1; /* normally it will be used with ESCIx_CR2[BESM13] = 1.*/

	        /* The error indicators NF, FE, BERR, STO, PBERR, CERR, CKERR, and OVFL should be enabled. */
	        /* Should we have these interrupts or check the status register? */
	        /*Initially a wakeup character may need to be transmitted on the LIN bus, so that the LIN slaves
	        activate.*/

	        esciHw->CR1.B.TE = 1; /* Both transmitter and receiver are enabled (ESCIx_CR1[TE] = 1, ESCIx_CR1[RE] = 1). */

			/** @req SWS_Lin_00171 */
			LinChannelOrderedStatus[Channel]=LIN_OPERATIONAL;
	        LinChannelStatus[Channel]=LIN_OPERATIONAL;
	    #ifdef MPC551X_ERRATA_REV_A
	        LinChannelTimeOutGptChannelId[ Channel ] = Config->LinTimeOutGptChannelId;
	        LinChannelBitTimeInTicks[ Channel ] = Mcu_Arc_GetPeripheralClock( Config->LinClockRef / Config->LinChannelBaudRate ) / Config->LinChannelBaudRate;
	    #endif


	}

	    /** @req SWS_Lin_00146 */
    /* LIN_UNINIT -> LIN_INIT: The Lin module shall transition from LIN_UNINIT
     * to LIN_INIT when the function Lin_Init is called. */
    LinDriverStatus = LIN_INIT;

}
void Lin_Arc_DeInit()
{
  LinDriverStatus = LIN_UNINIT;
  for (uint8 Channel =0; Channel < LIN_CONTROLLER_CNT; Channel++) {
      volatile struct ESCI_tag * esciHw = ESCI(LinConfigPtr->LinChannelConfig[Channel].LinChannelId);

