z2akhtar-zz/PWC-Demonstrator/AUTOSAR/core/arch/ppc/mpc55xx/drivers/Lin.c
#ifdef MPC551X_ERRATA_REV_A
    /* Make sure that the timer is stopped. */
    Gpt_StopTimer( LinChannelTimeOutGptChannelId[ Channel ] );
#endif

    if(LinChannelStatus[Channel] != LIN_CH_UNINIT){
        esciHw->CR2.B.MDIS = 1;/* The module is disabled by writing the ESCIx_CR2[MDIS] bit to 1. */

        LinChannelStatus[Channel]=LIN_CH_UNINIT;
    }
  }
}

#if (LIN_VERSION_INFO_API == STD_ON)
/** @req SWS_Lin_00161 **/
/** @reqSWS_Lin_00001 **/
void Lin_GetVersionInfo(Std_VersionInfoType* versioninfo)
{
	/** @req SWS_Lin_00248 **/
    /** @req SWS_Lin_00249 **/
    VALIDATE( !(versioninfo == NULL), LIN_GETVERSIONINFO_SERVICE_ID, LIN_E_PARAM_POINTER );

    /** @req SWS_Lin_00001 **/
    memcpy(versioninfo, &_Lin_VersionInfo, sizeof(Std_VersionInfoType));
    return;
}

#endif

/** @req SWS_Lin_00191 */
Std_ReturnType Lin_SendFrame(  uint8 Channel,  Lin_PduType* PduInfoPtr )
{
    LinSRtype tmp;
    LinLTRType tmpLtr;
	imask_t state;

	/** @req SWS_Lin_00195 */
	/** @req SWS_Lin_00214 */
	VALIDATE_W_RV( (LinDriverStatus != LIN_UNINIT), LIN_SEND_FRAME_SERVICE_ID, LIN_E_UNINIT, E_NOT_OK);

	/** @req SWS_Lin_00197 */
	/** @req SWS_Lin_00215 */
	VALIDATE_W_RV( (Channel < LIN_CONTROLLER_CNT), LIN_SEND_FRAME_SERVICE_ID, LIN_E_INVALID_CHANNEL, E_NOT_OK);
	/* Send header is used to wake the net in this implementation(no actual header is sent */
	/** @req SWS_Lin_00199 */
	/* @req SWS_Lin_00213 */
	VALIDATE_W_RV( (LinChannelStatus[Channel] != LIN_CH_SLEEP), LIN_SEND_FRAME_SERVICE_ID, LIN_E_STATE_TRANSITION, E_NOT_OK);
	/** @req SWS_Lin_00198 */
	/** @req SWS_Lin_00249 **/
	VALIDATE_W_RV( (PduInfoPtr != NULL), LIN_SEND_FRAME_SERVICE_ID, LIN_E_PARAM_POINTER, E_NOT_OK);

	volatile struct ESCI_tag * esciHw = ESCI(LinConfigPtr->LinChannelConfig[Channel].LinChannelId);

	/** @req SWS_Lin_00021 */
	 /* @req SWS_Lin_00074 */
    Irq_Save(state);
    if(LinChannelStatus[Channel] == LIN_TX_BUSY || LinChannelStatus[Channel] == LIN_TX_ERROR ||
       LinChannelStatus[Channel] == LIN_RX_BUSY || LinChannelStatus[Channel] == LIN_RX_ERROR ||
       LinChannelStatus[Channel] == LIN_RX_NO_RESPONSE || LinChannelStatus[Channel] ==LIN_TX_HEADER_ERROR)
    {
        ResyncDriver(Channel);
        LinChannelStatus[Channel]=LIN_OPERATIONAL;
    }
    Irq_Restore(state);

    /* @req SWS_Lin_00194 */
    /** @req SWS_Lin_00192 */
	/* Byte 1 */
	tmpLtr.R = 0; /* Clear */
	tmpLtr.B1.PID = PduInfoPtr->Pid;
	tmp.R = 0; /* Clear ready flag before send */
	tmp.B.TXRDY = 1;
	esciHw->SR.R = tmp.R;
	esciHw->LTR.R=tmpLtr.R; /* write to transmit reg */

	/* Byte 2 */
	tmpLtr.R = 0; /* Clear */
	tmpLtr.B2.L = PduInfoPtr->DI;
	tmp.R = 0; /* Clear ready flag before send */
	tmp.B.TXRDY = 1;
	esciHw->SR.R = tmp.R;
	esciHw->LTR.R=tmpLtr.R; /* write to transmit reg */

	/* Byte 3 */
	tmpLtr.R = 0; /* Clear */
	if (PduInfoPtr->Cs == LIN_ENHANCED_CS){ /*Frame identifiers 60 (0x3C) to 61 (0x3D) shall always use classic checksum */
		tmpLtr.B3.HDCHK = 1;
	}
	tmpLtr.B3.CSUM = 1; /* Append checksum to TX frame or verify for a RX */
	tmpLtr.B3.XCRC = 0; /* Append two CRC bytes(Not LIN standard) */

	/* Calculate the time out value for the frame.(10 * NDATA + 45) * 1.4 according to LIN1.3 */
	uint16 timeOutValue = (uint16)( ( ( 10 * PduInfoPtr->DI + 45 ) * 14 ) / 10);

	if (PduInfoPtr->Drc == LIN_MASTER_RESPONSE)
	{
		LinChannelStatus[Channel]=LIN_TX_BUSY;
		tmpLtr.B3.TX = 1; /* TX frame */
		tmpLtr.B3.TN = 0; /* Timeout not valid for TX */
		tmp.R = 0; /* Clear ready flag before send */
		tmp.B.TXRDY = 1;
		esciHw->SR.R = tmp.R;
		esciHw->LCR.B.FCIE = 1; /* Enable frame complete */
		esciHw->LCR.B.TXIE = 1; /* Enable tx irq */
		if (PduInfoPtr->DI > 0){
			TxCurrPtr[Channel] = LinBufTx[Channel];
			TxSize[Channel] = PduInfoPtr->DI;
			/* @req SWS_Lin_00053 */
			/* @req SWS_Lin_00025 */
			/* @req SWS_Lin_00026 */
			/* @req SWS_Lin_00096 */
			memcpy(TxCurrPtr[Channel],PduInfoPtr->SduPtr,PduInfoPtr->DI);
		}
		esciHw->LTR.R=tmpLtr.R; /* write to transmit reg */
	}

	/** @req SWS_Lin_00193 */
	else
	{
		LinChannelStatus[Channel]=LIN_RX_BUSY;
		RxCurrPtr[Channel] = LinBufRx[Channel];
		RxSize[Channel] = PduInfoPtr->DI;

		tmpLtr.B3.TX = 0; /* RX frame */
		tmpLtr.B3.TN = timeOutValue >> 8;     /* Most significant bits to be set here. */
		esciHw->LTR.R=tmpLtr.R; /* write to transmit reg */
		/* Byte 4 for RX */
		tmpLtr.R = 0; /* Clear */
        tmpLtr.B4.T = timeOutValue & 0xFF;   /* Least significant bits to be set here. */
		tmp.R = 0; /* Clear ready flag before send */
		tmp.B.TXRDY = 1;
		esciHw->SR.R = tmp.R;
		esciHw->LTR.R=tmpLtr.R; /* write to transmit reg */
		esciHw->LCR.B.FCIE = 1; /* Enable frame complete */
		esciHw->LCR.B.RXIE = 1; /* Enable rx irq */
	}

#ifdef MPC551X_ERRATA_REV_A
	/* Set up the GPT to twice as long time. Normally this time out shall not be needed but there are two
	* Erratas telling us that the LIN message timeout (written above to byte 3 and 4) is sometimes not used
	* by the LIN module and the LIN module state machine will then wait in infinity.
	* See [Freescale Device Errata MPC5510ACE, Rev. 10 APR 2009, errata ID: 8173 and 4968]. */
	Gpt_StopTimer( LinChannelTimeOutGptChannelId[ Channel ] );
	Gpt_StartTimer( LinChannelTimeOutGptChannelId[ Channel ], LinChannelBitTimeInTicks[ Channel ] * timeOutValue * 2 );
#endif

	return E_OK;
}

/**@req SWS_Lin_00166 */
Std_ReturnType Lin_GoToSleep(  uint8 Channel )
{
	Lin_PduType PduInfo;
	uint8 data[8] = {0x00,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF};

	/** @req SWS_Lin_00129*/
	/** @req SWS_Lin_00214 */
	VALIDATE_W_RV( (LinDriverStatus != LIN_UNINIT), LIN_GO_TO_SLEEP_SERVICE_ID, LIN_E_UNINIT, E_NOT_OK);

	/** @req SWS_Lin_00131*/
	/** @req SWS_Lin_00215 */
	VALIDATE_W_RV( (Channel < LIN_CONTROLLER_CNT), LIN_GO_TO_SLEEP_SERVICE_ID, LIN_E_INVALID_CHANNEL, E_NOT_OK);

	/* @req SWS_Lin_00033 */
	LinChannelOrderedStatus[Channel]=LIN_CH_SLEEP_PENDING;

	PduInfo.Cs = LIN_CLASSIC_CS;
	PduInfo.Pid = 0x3C;
	PduInfo.SduPtr = data;
	PduInfo.DI = 8;
	PduInfo.Drc = LIN_MASTER_RESPONSE;
	/** @req SWS_Lin_00089 */
    /** @req SWS_Lin_00074 */ //Cancellation of previous send in done in Lin_SendFrame Api
	Lin_SendFrame(Channel,  &PduInfo);

	return E_OK;
}

/** @req SWS_Lin_00167 */
Std_ReturnType Lin_GoToSleepInternal(  uint8 Channel )
{
    /** @req SWS_Lin_00133 */
    /** @req SWS_Lin_00214 */
	VALIDATE_W_RV( (LinDriverStatus != LIN_UNINIT), LIN_GO_TO_SLEEP_INTERNAL_SERVICE_ID, LIN_E_UNINIT, E_NOT_OK);

