z2akhtar-zz/PWC-Demonstrator/AUTOSAR/core/arch/ppc/mpc55xx/drivers/Lin.c
	/** @req SWS_Lin_00135 */
	/** @req SWS_Lin_00215 */
	VALIDATE_W_RV( (Channel < LIN_CONTROLLER_CNT), LIN_GO_TO_SLEEP_INTERNAL_SERVICE_ID, LIN_E_INVALID_CHANNEL, E_NOT_OK);

	/** @req SWS_Lin_00095 */
	LinChannelStatus[Channel] = LIN_CH_SLEEP;
	LinChannelOrderedStatus[Channel]=LIN_OPERATIONAL;
	return E_OK;
}

/** @req SWS_Lin_00169 */
Std_ReturnType Lin_WakeUp( uint8 Channel )
{
	/** @req SWS_Lin_00137 */
    /** @req SWS_Lin_00214 */
	VALIDATE_W_RV( (LinDriverStatus != LIN_UNINIT), LIN_WAKE_UP_SERVICE_ID, LIN_E_UNINIT, E_NOT_OK);

	/** @req SWS_Lin_00139 */
	/** @req SWS_Lin_00215 */
	VALIDATE_W_RV( (Channel < LIN_CONTROLLER_CNT), LIN_WAKE_UP_SERVICE_ID, LIN_E_INVALID_CHANNEL, E_NOT_OK);
	/** @req SWS_Lin_00140 */
	/* @req SWS_Lin_00213 */
	VALIDATE_W_RV( (LinChannelStatus[Channel] == LIN_CH_SLEEP), LIN_WAKE_UP_SERVICE_ID, LIN_E_STATE_TRANSITION, E_NOT_OK);

	volatile struct ESCI_tag * esciHw = ESCI(LinConfigPtr->LinChannelConfig[Channel].LinChannelId);

	/** Setting WU bit in LCR generates a wakeup pulse and the bit is autocleared by the hw.
	 * WUD register specifies how long the hw should wait before starting a new frame after generating wakeup
	 */
	/* @req SWS_Lin_00043 */
	/* @req SWS_Lin_00209 */
	//send wake up pulse
	esciHw->LCR.B.WU = 1;
	//wakeup delimiter time set to 32 bit times
	esciHw->LCR.B.WUD0 = 1;
	esciHw->LCR.B.WUD1 = 0;

	/**Lin_SendFrame API call will modify the channel status, so reset it here */
	/* @req SWS_Lin_00174 */
	LinChannelStatus[Channel]=LIN_OPERATIONAL;

	return E_OK;
}
/** @req SWS_Lin_00256 */
Std_ReturnType   Lin_WakeupInternal( uint8 Channel ) {
	/** @req SWS_Lin_00258 */
    /** @req SWS_Lin_00214 */
	VALIDATE_W_RV( (LinDriverStatus != LIN_UNINIT), LIN_WAKE_UP_INTERNAL_SERVICE_ID, LIN_E_UNINIT, E_NOT_OK);
	/** @req SWS_Lin_00259 */
	/** @req SWS_Lin_00215 */
	VALIDATE_W_RV( (Channel < LIN_CONTROLLER_CNT), LIN_WAKE_UP_INTERNAL_SERVICE_ID, LIN_E_INVALID_CHANNEL, E_NOT_OK);
	/** @req SWS_Lin_00260 */
	/* @req SWS_Lin_00213 */
	VALIDATE_W_RV( (LinChannelStatus[Channel] == LIN_CH_SLEEP), LIN_WAKE_UP_INTERNAL_SERVICE_ID, LIN_E_STATE_TRANSITION, E_NOT_OK);

	/**@req SWS_Lin_00257 */
	/* @req SWS_Lin_00261 */
	/* @req SWS_Lin_00262 */
	LinChannelStatus[Channel]=LIN_OPERATIONAL;
	return E_OK;
}
/** @req SWS_Lin_00168 */
Lin_StatusType Lin_GetStatus( uint8 Channel, uint8** Lin_SduPtr )
{
    /** @req SWS_Lin_00141*/
    /** @req SWS_Lin_00214 */
	VALIDATE_W_RV( (LinDriverStatus != LIN_UNINIT), LIN_GETSTATUS_SERVICE_ID, LIN_E_UNINIT, LIN_NOT_OK);
	/** @req SWS_Lin_00143*/
	/** @req SWS_Lin_00215 */
	VALIDATE_W_RV( (Channel < LIN_CONTROLLER_CNT), LIN_GETSTATUS_SERVICE_ID, LIN_E_INVALID_CHANNEL, LIN_NOT_OK);
	/** @req SWS_Lin_00144*/
	/** @req SWS_Lin_00249 **/
	VALIDATE_W_RV( (Lin_SduPtr!=NULL), LIN_GETSTATUS_SERVICE_ID, LIN_E_PARAM_POINTER, LIN_NOT_OK);

	imask_t state;
    Irq_Save(state);
	Lin_StatusType res = LinChannelStatus[Channel];

	/** @req SWS_Lin_00200 */
	switch (res) {
		case LIN_RX_OK:
			/** @req SWS_Lin_00092 */
		    /* @req SWS_Lin_00211 */
			*Lin_SduPtr = LinBufRx[Channel];
			//lint -fallthrough
		case LIN_TX_OK:
#ifdef HOST_TEST
			*Lin_SduPtr = LinBufTx[Channel];
#endif
			/** @req SWS_Lin_00238 */
			LinChannelStatus[Channel]=LIN_OPERATIONAL;
			break;

		case LIN_RX_ERROR:
			//lint -fallthrough
		case LIN_TX_ERROR:
			//lint -fallthrough
		case LIN_RX_NO_RESPONSE:
			//lint -fallthrough
		case LIN_TX_HEADER_ERROR:
			//lint -fallthrough

			ResyncDriver(Channel);
			LinChannelStatus[Channel]=LIN_OPERATIONAL;
			break;

		case LIN_CH_SLEEP_PENDING:
			/** @req SWS_Lin_00255 */
			res = LinChannelStatus[Channel]=LIN_CH_SLEEP;
			//lint -fallthrough
		default:
			break;
	}

    Irq_Restore(state);
    /** @req SWS_Lin_00091 */
    /* @req SWS_Lin_00022 */
    /* @req SWS_Lin_00024 */
	return res;
}





